In [1]:
dict = {
    'MIRPURKHAS' : 69000,
    'TANDO MUHAMMAD KHAN' : 70220,
    'SHAHZADPUR' : 134202,
    'TANDA JAM': 70050,
    'TANDO ADAM ' : 
}
val = int(input("enter their zip code : "))
for key, value in dict.items():
    if value == val:
        print(key)

enter their zip code : 69000
MIRPURKHAS

In [2]:
dicts = {
    "umer" : [73,81,68,76,90,80],
    "waleed" : [65,75,85,55,60,75],
    "anas" : [70,88,63,69,90,80],
    "hamza" : [76,67,78,87,90,75],
    "hammad" : [55,85,75,80,69,75]
}

for key, values in dicts.items():
    dicts[key] = sum(values)

In [3]:
dicts

{'umer': 468, 'waleed': 415, 'anas': 460, 'hamza': 473, 'hammad': 439}

In [4]:
df = dicts ['umer']
df

468

In [5]:
df/600*100

78.0

In [6]:
r = dicts ['waleed']
r

415

In [7]:
r/600*100

69.16666666666667

In [8]:
f = dicts ['anas']
f

460

In [9]:
f/600*100

76.66666666666667

In [10]:
bf = dicts ['hamza']
bf

473

In [11]:
bf/600*100

78.83333333333333

In [12]:
af = dicts ['hammad']
af

439

In [13]:
af/600*100

73.16666666666667

ASSINGMENTS 3

In [14]:
import pandas as pd

In [30]:
 d = {'name' : 'HAMMAD', 'date of birth' : '2002-01-03', 'rollnumber' : 13, 'marks' : 85}
 ds = pd.Series(d)
ds

name                 HAMMAD
date of birth    2002-01-03
rollnumber               13
marks                    85
dtype: object

In [31]:
 data = { 'name' : ['HAMMAD', 'BILAL', 'HAMZA','WASEEM'],
'run' : [35, 30, 2,56],
'Balls' : [32, 27, 3 ,58],
'minutes' : [32 , 24, 6,65],
'Dot' : [6, 3, 1,13]
}
 df = pd.DataFrame(data)
df

     name  run  Balls  minutes  Dot
0  HAMMAD   35     32       32    6
1   BILAL   30     27       24    3
2   HAMZA    2      3        6    1
3  WASEEM   56     58       65   13

In [32]:
sd= df[['name','run']]
sd

     name  run
0  HAMMAD   35
1   BILAL   30
2   HAMZA    2
3  WASEEM   56

In [33]:
sd.sort_values('run')

     name  run
2   HAMZA    2
1   BILAL   30
0  HAMMAD   35
3  WASEEM   56

In [34]:
da = df[['name','run', 'minutes']]
da

     name  run  minutes
0  HAMMAD   35       32
1   BILAL   30       24
2   HAMZA    2        6
3  WASEEM   56       65

In [35]:
sm_da = da
show= sm_da[(sm_da['run'] >= 30) & (sm_da['minutes'] >= 30)]

In [36]:
show

     name  run  minutes
0  HAMMAD   35       32
3  WASEEM   56       65